number //название переменных должно начинаться с латинтской буквы, _ и $
string
undefined 
null
Symbol //es6
Boolean
Array


var YouAreFaggot = {
    name: 'Dimf', //между частями объекта ставятся запятые 
    age: 15,
    gender: 'male' //после последнего ключа не нужно ставить ничего
};


var arr = [1, 2, 'str']; //цэ массив, в который мы можем поместить любые типы данных
//массив может быть представлен как объект
var objAsArray = {
    1: 1,
    2: 2,
    3: 'str',
    length: 3
}
//обращение к элементу массива происходит таким образом:
arr[0];
arr[1];
arr.length;